# Distance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallSweepInfo..::..Distance Property
WallSweepInfo Class See Also
---
Represents the distance from either the top or base of the wall for horizontal sweeps, or the parameter along the wall's path curve for vertical ones.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Distance { get; set; }
```

Visual Basic
---
```text
Public Property Distance As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Distance {
	double get ();
	void set (double value);
}
```

# ### Field Value
DistanceMeasuredFrom determines where the measurement starts from, depending on the orientation of the sweep. If the sweep or reveal is vertical, this distance is equal to the parameter along the wall's path curve.
# See Also
WallSweepInfo Class
Autodesk.Revit.DB Namespace